tap "federico-terzi/espanso"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# SMART hard drive monitoring
brew "smartmontools"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# JavaScript package manager
brew "yarn"
# Cross-platform Text Expander written in Rust
brew "federico-terzi/espanso/espanso"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Application launcher and productivity software
cask "alfred"
# Application window manager focusing on simplicity
cask "divvy"
# Management software and drivers for Data Robotics storage devices
cask "drobo-dashboard"
# Status monitoring
cask "eul"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox-developer-edition"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Menu bar calendar
cask "itsycal"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# App to manage software development and track bugs
cask "linear-linear"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Collection of apps available by subscription
cask "setapp"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Open-source BitTorrent client
cask "transmission"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "Codeshot", id: 1541665460
mas "Craft", id: 1487937127
mas "Disk Speed Test", id: 425264550
mas "Evernote", id: 406056744
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "HP Easy Scan", id: 967004861
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Klib", id: 1196268448
mas "LastPass", id: 926036361
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDF Squeezer 3", id: 504700302
mas "ScreenHint", id: 1566621533
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "UnPlugged", id: 423123087
mas "Unsplash Wallpapers", id: 1284863847
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
